Revit 2027 API
ParameterTypeId.ViewTemplateForSchedule Property
 "View Template"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ViewTemplateForSchedule { get; }
Public Shared ReadOnly Property ViewTemplateForSchedule As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ViewTemplateForSchedule {
	ForgeTypeId^ get ();
}
static member ViewTemplateForSchedule : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace